Revit 2024 API
BuiltInFailures.SteelElementsFailures Class
 Failures about SteelElement module
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SteelElementsFailures
Visual Basic
Public NotInheritable Class SteelElementsFailures
Visual C++
public ref class SteelElementsFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures
See Also
BuiltInFailures.SteelElementsFailures Members
Autodesk.Revit.DB Namespace